sdaiIsKindOfBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Determines whether a specified application instance is a kind of a specified type.
\param instance   [in] An application instance to be checked.
\param entityName [in] A string that contains the name the type.
\returns sdaiTRUE if the application instance is a kind of the specified type; otherwise, the function returns false.